[
{"link": "https://www.cnbc.com/quotes/TSLA", "name": "Tesla Inc", "description": "Tesla, Inc. designs, develops, manufactures, sells and leases fully electric vehicles and energy generation and storage systems, and offer services related to its products. The Company's automotive segment includes the design, development, manufacturing, sales, and leasing of electric vehicles as well as sales of automotive regulatory credits. Additionally, the automotive segment is also comprised of services and other, which includes non-warranty after-sales vehicle services, sales of used vehicles, retail merchandise, sales by its acquired subsidiaries to third party customers, and vehicle insurance. Its energy generation and storage segment include the design, manufacture, installation, sales and leasing of solar energy generation and energy storage products and related services and sales of solar energy systems incentives. Its automotive products include Model 3, Model Y, Model S and Model X. Powerwall and Megapack are its lithium-ion battery energy storage products."},
{"link": "https://www.cnbc.com/quotes/MELI", "name": "MercadoLibre Inc", "description": "Mercado Libre Inc is a Uruguay-based e-commerce business facilitator of Argentinian origins. The e-commerce products enable retail and wholesale via Internet platforms designed to provide users with a portfolio of services to facilitate commercial transactions. The Company's geographic coverage includes 18 countries of Latin America. The primary offer is an ecosystem of six integrated e-commerce services: the Mercado Libre Marketplace, the Mercado Libre Classifieds service, the Mercado Pago payments solution, the Mercado Credito financial solutions, the Mercado Envios logistic solutions including shipping, the Mercado Ads advertising platform and the Mercado Shops digital storefront solution."},
{"link": "https://www.cnbc.com/quotes/NXPI", "name": "NXP Semiconductors NV", "description": "NXP Semiconductors NV (NXP) is The Netherlands-based holding company. The Company operates as a semiconductor company. The Company provides high performance mixed signal analog-digital (mixed A/D) and standard product solutions. Its product solutions are used in a range of end-market applications, including automotive, personal security and identification, industrial & Internet of Things (IoT), wireless and wireline infrastructure, mobile communications, multi-market industrial, consumer and computing. It engages with global original equipment manufacturers (OEMs). The Company sells products in all geographic regions and countries: China, USA, Japan, Malaysia, South Korea, Germany, The Netherlands, and others."},
{"link": "https://www.cnbc.com/quotes/DDOG", "name": "Datadog Inc", "description": "Datadog, Inc. is the observability and security platform for cloud applications. The Company's software as a service (SaaS) platform integrates and automates infrastructure monitoring, application performance monitoring, log management, real-user monitoring, and various other capabilities to provide unified, real-time observability and security for its customers entire technology stack. Its platform consists of products that can be used individually or as a unified solution and includes a marketplace where customers can access products built by its partners on top of the Datadog platform. The Company's products include Infrastructure Monitoring, Application Performance Monitoring (APM), Log Management, Digital Experience Monitoring, Continuous Profiler, Database Monitoring, Network Monitoring, Incident Management, Observability Pipelines, Cloud Cost Management, Universal Service Monitoring, Cloud Security Management, Application Security Management, CI Visibility and others."},
{"link": "https://www.cnbc.com/quotes/JD", "name": "JD.Com Inc", "description": "JD.com Inc is a holding company mainly engaged in e-commerce business. The Company operates two segments. JD Retail segment consists of online retail, online marketplace and marketing services in China. The Company offers electronics products, home appliances and other general merchandise categories. The Company has its own online platform, which third-party merchants offer products on it. The Company provides marketing and display advertising services to third-party merchants, suppliers and other business partners on its website channels. New Businesses segment includes logistics services provided to third parties, overseas business, technology initiatives, as well as asset management services to logistics property investors and sale of development properties. It offers comprehensive supply chain solutions to third parties through JD Logistics, including warehousing, transportation, delivery and after-sales service. The Company mainly conducts its businesses in the China market."},
{"link": "https://www.cnbc.com/quotes/ADBE", "name": "Adobe Inc.", "description": "Adobe Inc. is a software company that offers a line of products and services used by professionals, communicators, businesses, and consumers for creating, managing, delivering, measuring, optimizing, engaging and transacting with content and experiences across various digital media formats. The Company’s segments include Digital Media, Digital Experience and Publishing and Advertising. Digital Media segment provides products, services and solutions that enable individuals, teams and enterprises to create, publish and promote their content anywhere. Digital Media segment is centered around Adobe Creative Cloud and Adobe Document Cloud. Digital Experience segment provides an integrated platform and set of applications and services through Adobe Experience Cloud that enable brands and businesses to create, manage, execute, measure, monetize and optimize customer experiences. The Publishing and Advertising segment consists of products and services that address diverse market opportunities."},
{"link": "https://www.cnbc.com/quotes/TMUS", "name": "T-Mobile US Inc", "description": "T-Mobile US, Inc. is a provider of mobile communications services, including voice, messaging and data, under its flagship brands, T-Mobile and Metro by T-Mobile, in the United States, Puerto Rico and the United States Virgin Islands. The Company provides mobile communications services primarily using its fourth generation (4G) long term evolution network and its fifth generation (5G) technology network. It also offers a selection of wireless devices, including handsets, tablets and other mobile communication devices, and accessories for sale, as well as financing through equipment installment plans and leasing through JUMP! On Demand. The Company’s primary service plan offers signature Magenta plan, which includes, among other benefits, unlimited talk, text and smartphone data on its network, 5G access at no extra cost. Customers can also choose additional features, such as unlimited premium data with its Ultra Capacity 5G service, for an additional cost on its Magenta Max plan."},
{"link": "https://www.cnbc.com/quotes/ON", "name": "ON Semiconductor Corp", "description": "ON Semiconductor Corporation provides intelligent sensing and power solutions. The Company's segments include the Power Solutions Group (PSG), the Advanced Solutions Group (ASG) and the Intelligent Sensing Group (ISG). The PSG segment offers a range of analog, discrete, module and integrated semiconductor products. The ASG segment designs and develops analog, mixed-signal, advanced logic, application specific standard products (ASSPs) and application specific integrated circuits (ASICs), radio frequency (RF) and integrated power solutions for a base of end-users in different end-markets. The Company's ISG segment designs and develops complementary metal oxide semiconductor (CMOS) image sensors, image signal processors, single photon detectors, including Silicon photomultipliers (SiPM) and Single photon avalanche diode (SPAD) arrays, as well as actuator drivers for autofocus and image stabilization for a base of end-users in the different end-markets."},
{"link": "https://www.cnbc.com/quotes/AAPL", "name": "Apple Inc", "description": "Apple Inc. (Apple) designs, manufactures and markets smartphones, personal computers, tablets, wearables and accessories and sells a range of related services. The Company’s products include iPhone, Mac, iPad, AirPods, Apple TV, Apple Watch, Beats products, HomePod, iPod touch and accessories. The Company operates various platforms, including the App Store, which allows customers to discover and download applications and digital content, such as books, music, video, games and podcasts. Apple offers digital content through subscription-based services, including Apple Arcade, Apple Music, Apple News+, Apple TV+ and Apple Fitness+. Apple also offers a range of other services, such as AppleCare, iCloud, Apple Card and Apple Pay. Apple sells its products and resells third-party products in a range of markets, including directly to consumers, small and mid-sized businesses, and education, enterprise and government customers through its retail and online stores and its direct sales force."},
{"link": "https://www.cnbc.com/quotes/CDNS", "name": "Cadence Design Systems Inc", "description": "Cadence Design Systems, Inc. is an electronic system designing company. The Company's Custom IC Design and Simulation offerings are used by its customers to create schematic and physical representations of circuits down to the transistor level for analog, mixed-signal, custom digital, memory and radio frequency (RF) designs. Its Digital IC Design and Signoff solutions are used to create logical representations of a digital circuit or an integrated circuit (IC) that can be verified for correctness prior to implementation. The Company’s Functional Verification products are used by its customers to verify that the circuitry or the software they have designed is consistent with the functional specification. Its IP offerings consist of pre-verified, customizable functional blocks. Its System Design and Analysis offerings are used by its customers to develop printed circuit boards (PCBs) and advanced IC packages and to analyze electromagnetic, electro-thermal and other multi-physics effects."},
{"link": "https://www.cnbc.com/quotes/GILD", "name": "Gilead Sciences Inc", "description": "Gilead Sciences, Inc. is a biopharmaceutical company. The Company is engaged in advancing medicines to prevent and treat life-threatening diseases, including human immunodeficiency virus (HIV), viral hepatitis and cancer. The Company offers products in HIV, Onocolgy, Liver Disease, Vekulaery, and Other. Under HIV, it offers Biktarvy, Complera/Eviplera, Genvoya, Odefsey, Stribild, and Truvada. Its Veklury (remdesivir) is a nucleotide analog RNA polymerase inhibitor indicated for the treatment of coronavirus disease 2019 (COVID-19). Under oncology it offers cell therapy containing Tecartus and Yescarta. Under this Liver Disease consists of Chronic hepatitis C virus (HCV) (Ledipasvir/Sofosbuvir and Sofosbuvir/Velpatasvir) and Chronic hepatitis B virus (HBV) / hepatitis delta virus (HDV) (Vemlidy and Viread). The Company's other products include AmBisome and Letairis. It also operates a portfolio of small molecule inhibitors targeting PARP1 for oncology and MK2 for inflammatory diseases."},
{"link": "https://www.cnbc.com/quotes/VRSK", "name": "Verisk Analytics Inc", "description": "Verisk Analytics, Inc. is a data analytics provider that serves insurance industry. The Company offers predictive analytics and decision support solutions to customers in rating, underwriting, claims, catastrophe and weather risk, global risk analytics, and many other fields. The Company’s Insurance segment primarily serves its property and casualty (P&C) insurance customers and focuses on the prediction of loss, the selection and pricing of risk, and compliance with their reporting requirements in each United States state in which the Company operate. The Company also develop and utilize machine learned and artificially intelligent models to forecast scenarios and produce both standard and customized analytics that help its customers better manage their businesses, including detecting fraud before and after a loss event and quantifying losses. It also helps businesses and governments better anticipate and manage climate and weather-related risks."},
{"link": "https://www.cnbc.com/quotes/ABNB", "name": "Airbnb Inc", "description": "Airbnb, Inc. primarily operates a global platform for stays and experiences. The Company’s marketplace model connects hosts and guests online or through mobile devices to book spaces and experiences around the world. It partners with hosts throughout the process of setting up their listing and provide them with a range of tools to manage their listings, including scheduling, merchandising, integrated payments, community support, host protections, pricing guidance, and feedback from reviews. Its Website and mobile applications provide its guests a way to explore a variety of homes and experiences and an easy way to book them. Its hosts generally fall into two categories: individual and professional. Individual hosts list their spaces, including private rooms, primary homes, or vacation homes, on Airbnb. Professional hosts are often those who run property management or hospitality businesses and generally use application programming interfaces to list their properties on its platform."},
{"link": "https://www.cnbc.com/quotes/WDAY", "name": "Workday Inc", "description": "Workday, Inc. is a provider of enterprise cloud applications for finance and human resources. The Company provides approximately 10,000 organizations with software-as-a-service solutions to help solve business challenges, including supporting and empowering their workforce, managing their finances and spending in an ever-changing environment, and planning for the unexpected. The Company provides organizations with a unified system that can help them plan, execute, analyze, and extend to other applications and environments, thereby helping them continuously adapt how they manage their business and operations. It embeds artificial intelligence (AI) and machine learning (ML) into its platform, enabling its applications to natively leverage AI and ML as part of the workflow. The Company sells its solutions worldwide primarily through direct sales. The Company also offers professional services, both directly and through its Workday Services Partners to help customers deploy its solutions."},
{"link": "https://www.cnbc.com/quotes/HON", "name": "Honeywell International Inc", "description": "Honeywell International Inc. is a software-industrial company that provides technology solutions. The Company operates through four segments: Aerospace, Honeywell Building Technologies, Performance Materials and Technologies, and Safety and Productivity Solutions. The Aerospace segment supplies products, software and services for aircrafts that it sells to original equipment manufacturers (OEM) and other customers in various end markets. The Honeywell Building Technologies segment offers products, software, solutions and technologies that enable building owners and occupants to ensure their facilities are safe, energy efficient, sustainable and productive. The Performance Materials and Technologies segment is engaged in developing and manufacturing performance chemicals and materials, process technologies and automation solutions. The Safety and Productivity Solutions segment provides products and software that improve productivity, workplace safety, and asset performance to customers."},
{"link": "https://www.cnbc.com/quotes/ORLY", "name": "O'Reilly Automotive Inc", "description": "O’Reilly Automotive, Inc. is a specialty retailer of automotive aftermarket parts, tools, supplies, equipment, and accessories in the United States. The Company sells its products to both do-it-yourself (DIY) and professional service provider customers. Its product line includes new and remanufactured automotive hard parts and maintenance items, such as alternators, batteries, brake system components, belts, chassis parts, driveline parts, engine parts, fuel pumps, hoses, starters, temperature control, water pumps, antifreeze, appearance products, engine additives, filters, fluids, lighting, oil and wiper blades, and accessories, such as floor mats, seat covers and truck accessories. The Company's stores offer various services and programs to its customers, such as battery diagnostic testing; battery, wiper and bulb replacement; custom hydraulic hoses; drum and rotor resurfacing; electrical and module testing; loaner tool program, and used oil, oil filter and battery recycling."},
{"link": "https://www.cnbc.com/quotes/ADI", "name": "Analog Devices Inc", "description": "Analog Devices, Inc. is a semiconductor company. The Company designs, manufactures, tests and markets a portfolio of solutions, including integrated circuits (ICs), software and subsystems that leverage analog, mixed-signal and digital signal processing technologies. Its products include data converters, amplifiers, power management, radio frequency (RF) ICs, edge processors and other sensors. The Company's ICs are designed to address a range of real-world signal-processing applications. Its IC product portfolio includes both general-purpose products used by a range of customers and applications, as well as application-specific products designed for specific target markets. The Company's product offerings include more than 75,000 stock-keeping units (SKUs) that can be aggregated into various general categories, such as analog and mixed-signal, power management and reference, amplifiers/RF and microwave, sensors and actuators, and digital signal processing and system products (DSPs)."},
{"link": "https://www.cnbc.com/quotes/BKR", "name": "Baker Hughes Co", "description": "Baker Hughes Company is an energy technology company. The Company’s segments include Oilfield Services & Equipment (OFSE), and Industrial & Energy Technology (IEM). The OFSE segment designs and manufactures products and provides services for onshore and offshore oil and gas operations across the lifecycle of a well, including exploration, drilling, evaluation, completion, production, intervention and abandonment. The OFSE segment is organized into four product lines, including Well Construction; Completions, Intervention, and Measurements; Production Solutions, and Subsea and Surface Pressure Systems. The IEM segment provides technology solutions and services for mechanical-drive, compression and power-generation applications across the energy industry, including oil and gas, liquefied natural gas operations, downstream refining and petrochemical markets, as well as lower carbon solutions to broader energy and industrial sectors. It also provides equipment, software, and services."},
{"link": "https://www.cnbc.com/quotes/ANSS", "name": "ANSYS Inc", "description": "ANSYS, Inc. develops and globally markets engineering simulation software and services used by engineers, designers, researchers and students. The Company caters to a range of industries and academia, including high-tech, aerospace and defense, automotive, energy, industrial equipment, materials and chemicals, consumer products, healthcare, and construction. The Company’s solutions enable users to analyze designs on-premises and/or via the cloud, providing a common platform for product development, from design concept to final-stage testing, validation and deployment. The Company distributes its suite of simulation technologies through direct sales offices and a network of independent resellers and distributors. Its product portfolio consists of ANSYS Workbench, Structures, Fluids, Electronics, Semiconductors, Multiphysics, Embedded Software, Systems, Three-Dimensional (3D) Design, and Optical. Its structural analysis product offers simulation tools for product design and optimization."},
{"link": "https://www.cnbc.com/quotes/CMCSA", "name": "Comcast Corp", "description": "Comcast Corporation is a global media and technology company. The Company provides broadband, wireless, and video through Xfinity, Comcast Business, and Sky; produce, distribute, and stream entertainment, sports, and news through brands, including NBC, Telemundo, Universal, Peacock, and Sky; and brings theme parks and attractions to life through Universal Destinations and Experiences. The Company operates through two primary businesses, namely Connectivity & Platforms and Content & Experiences. The Connectivity & Platforms segment contains its broadband and wireless connectivity businesses operated under the Xfinity and Comcast brands in the United States and under the Sky brand in certain territories in Europe. The Content & Experiences segment contains its media and entertainment businesses that develop, produce, and distribute entertainment, news and information, sports, and other content for global audiences and that own and operate theme parks in the United States and Asia."},
{"link": "https://www.cnbc.com/quotes/MU", "name": "Micron Technology Inc", "description": "Micron Technology, Inc. is a provider of memory and storage solutions. The Company's product portfolio includes dynamic random-access memory (DRAM), negative-AND (NAND), three-dimensional (3D) XPoint memory, and NOR, solid-state drives, graphics and high bandwidth memory (HBM), managed NAND and multichip packages. Its brands include Micron and Crucial. The Company's segments include Compute and Networking Business Unit (CNBU) includes memory products sold into client, cloud server, enterprise, graphics, and networking markets; Mobile Business Unit (MBU) includes memory and storage products sold into smartphone and other mobile-device markets; Storage Business Unit (SBU) includes solid state drives (SSDs) and component-level solutions sold into enterprise and cloud, client, and consumer storage markets and other discrete storage products; Embedded Business Unit (EBU) includes memory and storage products sold into automotive, industrial, and consumer markets."},
{"link": "https://www.cnbc.com/quotes/KDP", "name": "Keurig Dr Pepper Inc", "description": "Keurig Dr Pepper Inc. is a beverage company in North America. The Company has a diverse portfolio of flavored (non-cola) carbonated soft drinks (CSDs), non-carbonated beverages (NCBs), including water, ready-to-drink tea and coffee, juice, juice drinks, mixers, and specialty coffee, and is a producer of single serve brewing systems. Its segments include U.S. Refreshment Beverages, U.S. Coffee segment, and International. The U.S. Refreshment Beverages segment is engaged in the manufacture and distribution of branded concentrates, syrup and finished beverages. The U.S. Coffee segment is engaged in the manufacture and distribution of finished goods relating to the Company's K-Cup pods, single-serve brewers and accessories, and other coffee products to partners, retailers and directly to consumers. The International segment includes sales in Canada, Mexico, the Caribbean and other international markets. Its portfolio consists of approximately 125 owned, licensed and partner brands."},
{"link": "https://www.cnbc.com/quotes/GEHC", "name": "GE Healthcare Technologies Inc", "description": "GE HealthCare Technologies Inc. is a global medical technology, pharmaceutical diagnostics, and digital solutions company. The Company develops, manufactures, and markets a portfolio of products, services, and complementary digital solutions used in the diagnosis, treatment, and monitoring of patients. The Company's segments include Imaging, Ultrasound, Patient Care Solutions and Pharmaceutical Diagnostics. The Imaging segment includes scanning devices, clinical applications, service capabilities and digital solutions. The Ultrasound segment includes screening, diagnosis, treatment, and monitoring of certain diseases. The Patient Care Solutions segment includes medical devices, services, consumable products, services, and digital solutions. The Pharmaceutical Diagnostics segment is a supplier of diagnostic agents to the global radiology and nuclear medicine industry."},
{"link": "https://www.cnbc.com/quotes/KHC", "name": "Kraft Heinz Co", "description": "The Kraft Heinz Company (KHC) is a global food and beverage company. KHC manufactures and markets food and beverage products, including dairy products, meat products, soybean and vegetable oils, tomatoes, coffee beans, sugar and other sweeteners, other fruits and vegetables, corn products, wheat products and potatoes. The Company's geographic segments include North America and International. Its North America segment offers various brands, which include Kraft, Oscar Mayer, Heinz, Philadelphia, Lunchables, Velveeta, Capri Sun, Maxwell House, Ore-Ida, Kool-Aid and Jell-O. Its International segment offers various brands, such as International Heinz, ABC, Master, Kraft, Quero, Golden Circle, Wattie’s, Plasmon and Pudliszki. Its products are sold through its own sales organizations and through independent brokers, agents, and distributors to chain, wholesale, cooperative and independent grocery accounts, convenience stores, drug stores, value stores, bakeries, pharmacies and institutions."},
{"link": "https://www.cnbc.com/quotes/MDLZ", "name": "Mondelez International Inc", "description": "Mondelez International, Inc. is a snack company. The Company’s core business is making and selling chocolate, biscuits, and baked snacks. Its additional business in locally relevant categories, including gum and candy, cheese and grocery and powdered beverages. The Company’s portfolio includes global and local brands such as Oreo, Ritz, LU, CLIF Bar and Tates Bake Shop biscuits and baked snacks, as well as Cadbury Dairy Milk, Milka and Toblerone chocolate. It sells its products to supermarket chains, wholesalers, supercenters, club stores, mass merchandisers, distributors, convenience stores, gasoline stations, drug stores, value stores and other retail food outlets. It also sells products directly to businesses and consumers through various e-retail platforms, retailer digital platforms, its direct-to-consumer websites, and social media platforms. Its segments include Latin America, AMEA, Europe, and North America. It sells its products in over 150 countries globally."},
{"link": "https://www.cnbc.com/quotes/BIIB", "name": "Biogen Inc", "description": "Biogen Inc. is a global biotechnology company. The Company is focused on discovering, developing and delivering therapies for people living with serious and complex diseases worldwide. It has a portfolio of medicines to treat multiple sclerosis, spinal muscular atrophy (SMA) and Alzheimer's disease. It is focused on advancing its pipeline in neurology, neuropsychiatry, specialized immunology and rare diseases. Its marketed products include TECFIDERA, VUMERITY, AVONEX, PLEGRIDY, TYSABRI and FAMPYRA for the treatment of MS; SPINRAZA for the treatment of SMA; ADUHELM for the treatment of Alzheimer's disease; FUMADERM for the treatment of severe plaque psoriasis, and SKYCLARYS (omaveloxolone). It is also advancing its mid-to-late stage programs, including zuranolone for major depressive disorder (MDD) and postpartum depression (PPD); BIIB080 for Alzheimer's disease; tofersen for amyotrophic lateral sclerosis (ALS), and both litifilimab and dapirolizumab pegol for certain forms of lupus."},
{"link": "https://www.cnbc.com/quotes/ZS", "name": "Zscaler Inc", "description": "Zscaler, Inc. is a cloud security company, which has developed a platform incorporating core security functionalities needed to enable access to cloud resources based on identity, context and organization’s policies. The Company’s solution is a purpose-built, multi-tenant, distributed cloud platform that incorporates the security functionality needed to enable users, applications and devices to utilize authorized applications and services based on an organization’s business policies. The Company delivers its solutions using a software-as-a-service (SaaS) business model and sells subscriptions to customers to access its cloud platform, together with related support services. The Company’s cloud-native platform, the Zscaler Zero Trust Exchange, enables customers to secure and connect users, workloads and Internet of things (IoT)/ operational technology (OT) devices across three core products, Zscaler for Users, Zscaler for Workloads and Zscaler for IoT/OT."},
{"link": "https://www.cnbc.com/quotes/AEP", "name": "American Electric Power Company Inc", "description": "American Electric Power Company, Inc. is an electric public utility holding company. It operates and maintains the electricity transmission system and distribution lines to deliver power. Its segments include Vertically Integrated Utilities, Transmission and Distribution Utilities, AEP Transmission Holdco, and Generation & Marketing. Vertically Integrated Utilities segment is engaged in the generation, transmission, and distribution of electricity for sale to retail and wholesale customers. Transmission and Distribution Utilities segment is engaged in the transmission and distribution of electricity for sale to retail and wholesale customers. AEP Transmission Holdco segment is engaged in the development, construction, and operation of transmission facilities. Generation & Marketing segment conducts marketing, risk management and retail activities. It is also an electricity producer with nearly 29,000 megawatts (MW) of generating capacity, including about 5,800 MW of renewable energy."},
{"link": "https://www.cnbc.com/quotes/LCID", "name": "Lucid Group Inc", "description": "Lucid Group, Inc. is a technology and automotive company. The Company is focused on designing, developing, manufacturing, and selling of electric vehicles (EV), EV powertrains and battery systems using its own equipment and factories. It offers its own geographically distributed retail and service locations and through direct-to-consumer online and retail sales. It also boasts a product roadmap of future vehicle programs and technologies. It focuses on in-house technology innovation, vertical integration, and a clean-sheet approach to engineering and design have led to the development of Lucid Air. The Lucid Air is an electric sedan that redefines both the luxury car segment and the electric vehicle space. Lucid Air is manufactured at its greenfield electric vehicle manufacturing facility in Casa Grande, Arizona, Advanced Manufacturing Plant-1. It also owns and operates a vehicle service network comprised of service centers in metropolitan areas and a fleet of mobile service vehicles."},
{"link": "https://www.cnbc.com/quotes/CHTR", "name": "Charter Communications Inc", "description": "Charter Communications, Inc. is a broadband connectivity company and cable operator serving more than 32 million customers in 41 states through its Spectrum brand. The Company offers a range of residential and business services including Spectrum Internet, television (TV), mobile and voice. Its Spectrum Business delivers a range of broadband products and services coupled with features and applications to enhance productivity of small and medium-sized companies. Spectrum Enterprise provides highly customized, fiber-based solutions for larger businesses and government entities. Its Spectrum Reach delivers tailored advertising and production for the modern media landscape. The Company also distributes news coverage and sports programming to its customers through Spectrum Networks. Its Spectrum Mobile service is offered to customers subscribing to its Internet service, and runs on Verizon Communications Inc.(Verizon) mobile network, combined with Spectrum WiFi."},
{"link": "https://www.cnbc.com/quotes/AVGO", "name": "Broadcom Inc", "description": "Broadcom Inc. is a global technology company that designs, develops and supplies a range of semiconductor and infrastructure software solutions. The Company’s segments include semiconductor solutions and infrastructure software. The semiconductor solutions segment includes all of its product lines and intellectual property (IP) licensing. Its infrastructure software segment includes its mainframe, distributed and cyber security solutions, and its fiber channel storage area networking (FC SAN) business. It provides semiconductor solutions for managing the movement of data in data center, service provider, enterprise and embedded networking applications. It provides a variety of radio frequency semiconductor devices, wireless connectivity solutions, custom touch controllers, and inductive charging solutions for mobile applications. It provides a portfolio of software solutions that enables customers to plan, develop, automate, manage, and secure applications across various platforms."},
{"link": "https://www.cnbc.com/quotes/ODFL", "name": "Old Dominion Freight Line Inc", "description": "Old Dominion Freight Line, Inc. is a North American less-than-truckload (LTL) motor carriers. The Company provides regional, inter-regional and national LTL services through a single integrated, union-free organization. Its service offerings include expedited transportation, which is provided through a network of service centers located throughout the continental United States. It offers a range of value-added services including container drayage, truckload brokerage, and supply chain consulting. It operates approximately 255 service center locations, of which the Company owns 231 and leases 24. Its service centers are responsible for the pickup and delivery of freight within their local service area. Its system offers its customers access to information such as freight tracking, shipping documents, rate quotes, rate databases, and account activity. These centralized systems and its customer service department provide its customers with a single point of contact to access information."},
{"link": "https://www.cnbc.com/quotes/AMGN", "name": "Amgen Inc", "description": "Amgen Inc. is a biotechnology company. The Company discovers, develops, manufactures and delivers various human therapeutics. It operates in human therapeutics segment. The Company’s marketed products portfolio includes Aranesp, ENBREL, Prolia (denosumab), Neulasta (pegfilgrastim), Otezla, XGEVA, Aranesp (darbepoetin alfa), KYPROLIS, Repatha (evolocumab), Nplate (romiplostim), Vectibix (panitumumab), MVASI (bevacizumab-awwb), Parsabiv (etelcalcetide), EPOGEN (epoetin alfa), KANJINTI (trastuzumab-anns), BLINCYTO (blinatumomab), Aimovig (erenumab-aooe), EVENITY (romosozumab-aqqg), AMGEVITATM (adalimumab), Sensipar/Mimpara (cinacalcet), NEUPOGEN (filgrastim), IMLYGIC (talimogene laherparepvec), Corlanor (ivabradine) and AVSOLA (infliximab-axxq), Evenity, LumaKras, Nplate, XGeva, and others. The Company focuses on human therapeutics for the treatment of serious illness in the areas of inflammation, oncology/hematology, bone health, cardiovascular disease, nephrology and neuroscience."},
{"link": "https://www.cnbc.com/quotes/FANG", "name": "Diamondback Energy Inc", "description": "Diamondback Energy, Inc. is an independent oil and gas company, which is focused on the acquisition, development, exploration and exploitation of unconventional, onshore oil and natural gas reserves in the Permian Basin in West Texas. The Company operates through upstream segment, which is engaged in the acquisition, development, exploration and exploitation of unconventional, onshore oil and natural gas reserves primarily in the Permian Basin in West Texas. The midstream operations are focused on owning, operating, developing and acquiring midstream infrastructure assets in the Midland and Delaware Basins of the Permian Basin. Its total acreage position in the Permian Basin is approximately 508,767 net acres, which consisted primarily of approximately 325,540 acres in the Midland Basin and approximately 150,719 acres in the Delaware Basin. The Company’s subsidiaries include Diamondback E&P LLC, Viper Energy Partners GP LLC, Rattler Midstream GP LLC, and QEP Resources, Inc."},
{"link": "https://www.cnbc.com/quotes/ADP", "name": "Automatic Data Processing Inc", "description": "Automatic Data Processing, Inc. (ADP) is a global technology company engaged in providing cloud-based human capital management (HCM) solutions that unite HR, payroll, talent, time, tax and benefits administration. Its segments include Employer Services and Professional Employer Organization (PEO). Its Employer Services segment serves clients ranging from single-employee small businesses to large enterprises with tens of thousands of employees around the world, offering a range of technology-based HCM solutions, including its cloud-based platforms, and human resource outsourcing (HRO) solutions (other than PEO) solutions. Its offerings include Payroll Services, Benefits Administration, Talent Management, HR Management, Workforce Management, Compliance Services, Insurance Services and Retirement Services. Its PEO business, called ADP TotalSource, provides clients with employment administration outsourcing solutions. ADP serves over one million clients in 140 countries and territories."},
{"link": "https://www.cnbc.com/quotes/XEL", "name": "Xcel Energy Inc", "description": "Xcel Energy Inc. is an electric and natural gas delivery company. The Company provides a portfolio of energy-related products and services through its four utility subsidiaries. Its segments include Regulated Electric and Regulated Natural Gas. The Regulated Electric Utility segment generates, transmits and distributes electricity in Minnesota, Wisconsin, Michigan, North Dakota, South Dakota, Colorado, Texas and New Mexico. In addition, this segment includes sales for resale and provides wholesale transmission service to various entities in the United States. The regulated electric utility segment also includes wholesale commodities and trading operations. The Regulated Natural Gas Utility segment transports, stores and distributes natural gas primarily in portions of Minnesota, Wisconsin, North Dakota, Michigan and Colorado. Its subsidiaries include NSP-Minnesota, NSP-Wisconsin, Public Service Company of Colorado, and Southwestern Public Service Co. (SPS)."},
{"link": "https://www.cnbc.com/quotes/ASML", "name": "ASML Holding NV", "description": "ASML Holding N.V. is a holding company based in the Netherlands. The Company operates through its subsidiaries in the Netherlands, the United States, Italy, France, Germany, the United Kingdom, Ireland, Belgium, South Korea, Taiwan, Singapore, China, Hong Kong, Japan, Malaysia and Israel. The Company operates through one business segment which is engage in development, production, marketing, sales, upgrading and servicing of advanced semiconductor equipment systems, consisting of lithography, metrology and inspection systems. The Company offers TWINSCAN systems, equipped with lithography system with a mercury lamp as light source (i-line), Krypton Fluoride (KrF) and Argon Fluoride (ArF) light sources for processing wafers for manufacturing environments for which imaging at a small resolution is required. TWINSCAN systems also include immersion lithography systems (TWINSCAN immersion systems)."},
{"link": "https://www.cnbc.com/quotes/FAST", "name": "Fastenal Co", "description": "Fastenal Company is engaged in the wholesale distribution of industrial and construction supplies. The Company is a distributor of threaded fasteners, bolts, nuts, screws, studs, and related washers, as well as miscellaneous supplies and hardware. Its customers are in the manufacturing and non-residential construction markets. The manufacturing market includes sales of products for both original equipment manufacturing (OEM), where its products are consumed in the final products of its customers, and manufacturing, repair, and operations (MRO), where its products are consumed to support the facilities and ongoing operations of its customers. The non-residential construction market includes general, electrical, plumbing, sheet metal and road contractors. Other users of its products include farmers, truckers, railroads, oil exploration companies, oil production and refinement companies, mining companies, federal, state, and local governmental entities, schools, and certain retail trades."},
{"link": "https://www.cnbc.com/quotes/LULU", "name": "Lululemon Athletica Inc", "description": "lululemon athletica inc. is engaged in the design, distribution, and retail of technical athletic apparel, footwear, and accessories. The Company’s segments include company-operated stores and direct to consumer. Its apparel assortment includes items, such as pants, shorts, tops, and jackets designed for a healthy lifestyle, including athletic activities, such as yoga, running, training, and other activities. It also offers apparel designed for being on the move and fitness-inspired accessories. Its technical athletic apparel, footwear, and accessories, which are sold through a chain of company-operated stores, direct to consumers through e-commerce, outlets, sales to wholesale accounts, license and supply arrangements, recommence, and sales from temporary locations. It also offers in-home connected fitness and associated content subscriptions through lululemon Studio. It operates stores in the United States, Canada, Australia, the United Kingdom, South Korea, Germany and others."},
{"link": "https://www.cnbc.com/quotes/CSCO", "name": "Cisco Systems Inc", "description": "Cisco Systems, Inc. designs and sells a range of technologies that power the Internet. It is integrating its platforms across networking, security, collaboration, applications and the cloud. Its segments include the Americas; Europe, Middle East, and Africa (EMEA), and Asia Pacific, Japan, and China (APJC). Its product categories include Secure, Agile Networks; Internet for the Future; Collaboration; End-to-End Security; Optimized Application Experiences, and Other Products. Secure, Agile Networks consists of its core networking technologies of switching, enterprise routing, wireless, and compute products. Internet for the Future consists of its routed optical networking, public fifth generation (5G), silicon, and optics solutions. Collaboration consists of its meetings, collaboration devices, calling, contact center and communication platform as a service (CPaaS) offering. End-to-End Security consists of cloud and application security, industrial security and other offering."},
{"link": "https://www.cnbc.com/quotes/LRCX", "name": "Lam Research Corp", "description": "Lam Research Corporation is a supplier of wafer fabrication equipment and services to the semiconductor industry. The Company designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. Its products and services are designed to help its customers build devices that are used in a variety of electronic products, including mobile phones, personal computers, servers, wearables, automotive vehicles, and data storage devices. Its product families include ALTUS, SABRE, SPEED, Striker, VECTOR, Flex, Kiyo, Syndion, Versys Metal, Coronus, DV-Prime , Da Vinci , EOS , and SP Series. Its customer base includes semiconductor memory, foundries, and integrated device manufacturers (IDMs) that make products, such as non-volatile memory (NVM), dynamic random-access memory (DRAM) and logic devices. It offers services in areas, such as nanoscale applications enablement, chemistry, plasma and fluidics, and others."},
{"link": "https://www.cnbc.com/quotes/SIRI", "name": "Sirius XM Holdings Inc", "description": "Sirius XM Holdings Inc. is an audio entertainment company. The Company operates through two segments: Sirius XM and Pandora and Off-platform. Sirius XM segment features music, sports, entertainment, comedy, talk, news, traffic and weather channels and other content, as well as podcasts and infotainment services in the United States on a subscription basis. Sirius XMs premier content bundles include live, curated and certain exclusive and on demand programming. Pandora and Off-platform segment operates a music, comedy and podcast streaming platform, offering a personalized experience for each listener wherever and whenever they want to listen, whether through mobile devices, car speakers or connected devices. It has a portfolio of audio businesses, including its flagship subscription entertainment service, Sirius XM; the ad-supported and premium music streaming services of Pandora; a podcast network; an advertising sales group, SXM Media; and a suite of advertising technology solutions."},
{"link": "https://www.cnbc.com/quotes/FI", "name": "Fiserv Inc", "description": "Fiserv, Inc. is a global provider of payments and financial services technology solutions. The Company provides account processing and digital banking solutions, card issuer processing and network services, card issuer processing and network services, payments, e-commerce, merchant acquiring and processing, and the Clover cloud-based point-of-sale solution and business management platform. The Company’s segments include Merchant Acceptance (Acceptance), Financial Technology (Fintech) and Payments and Network (Payments). The Acceptance segment provides a range of commerce-enabling solutions and serves merchants of all sizes around the world. The Fintech segment provides financial institutions around the world with the technology solutions they need to run their operations. The Payments segment provides financial institutions and corporate clients around the world with the products and services required to process digital payment transactions."},
{"link": "https://www.cnbc.com/quotes/ROST", "name": "Ross Stores Inc", "description": "Ross Stores, Inc. is engaged in operating two brands of off-price retail apparel and home fashion stores-Ross Dress for Less (Ross) and dd’s DISCOUNTS. Ross is the off-price apparel and home fashion chain in the United States, with 1,693 locations in 40 states, the District of Columbia, and Guam. Ross offers in-season, name brand and designer apparel, accessories, footwear, and home fashions for the entire family at savings of 20% to 60% off department and specialty store regular prices every day. The Company also operates dd’s DISCOUNTS stores in 21 states, which offer in-season, name brand apparel, accessories, footwear, and home fashions for the entire family at savings of 20% to 70% off department and discount store regular prices every day. It operates a total of 2,015 stores comprised of 1,693 Ross stores and 322 dd’s DISCOUNTS stores. It operates distribution processing facilities. It also operates warehouse facilities for pack away storage."},
{"link": "https://www.cnbc.com/quotes/PANW", "name": "Palo Alto Networks Inc", "description": "Palo Alto Networks, Inc. is a global cybersecurity provider. The Company's cybersecurity platforms and services help secure enterprise users, networks, clouds and endpoints by delivering comprehensive cybersecurity backed by artificial intelligence and automation. The Company focuses on delivering value in four areas, Network Security, Cloud Security, Security Operations and Threat Intelligence and Security Consulting. Its network security platform is designed to deliver complete zero trust solutions to its customers. It enables cloud-native security through its Prisma Cloud platform. As a comprehensive Cloud Native Application Protection Platform (CNAPP), Prisma Cloud secures multi-and hybrid-cloud environments for applications, data and the entire cloud native technology stack across the full development lifecycle, from code to runtime. It delivers security automation, security analytics, endpoint security and attack surface management solutions through its Cortex portfolio."},
{"link": "https://www.cnbc.com/quotes/QCOM", "name": "Qualcomm Inc", "description": "Qualcomm Incorporated is engaged in the development and commercialization of foundational technologies for the wireless industry. The Company’s segments Qualcomm CDMA Technologies (QCT), Qualcomm Technology Licensing (QTL) and Qualcomm Strategic Initiatives (QSI). QCT segment develops and supplies integrated circuits and system software based on third generation/fourth generation/fifth generation (3G/4G/5G) and other technologies for use in wireless voice and data communications, networking, computing, multimedia and global positioning system (GPS) products. QTL Segment grants licenses or otherwise provides rights to use portions of its intellectual property portfolio, which, among other rights, includes certain patent rights essential to and/or useful in the manufacture, sale and/or use of certain wireless products, including, without limitation, products implementing CDMA2000, WCDMA, LTE and/or OFDMA-based 5G standards and their derivatives. QSI Segment makes strategic investments."},
{"link": "https://www.cnbc.com/quotes/COST", "name": "Costco Wholesale Corp", "description": "Costco Wholesale Corporation operates membership warehouses and e-commerce websites. The Company operates 861 warehouses, including 591 in the United States and Puerto Rico, 107 in Canada, 40 in Mexico, 33 in Japan, 29 in the United Kingdom, 18 in Korea, 15 in Australia, 14 in Taiwan, five in China, four in Spain, two in France, and one each in Iceland, New Zealand and Sweden. It also operates e-commerce sites in the United States, Canada, the United Kingdom, Mexico, Korea, Taiwan, Japan and Australia. It provides a wide selection of merchandise, convenience of specialty departments and exclusive member services. It operates through three segments: United States Operations, Canadian Operations, and Other International Operations. The Company offers merchandise categories (foods and sundries, non-foods, and fresh foods), warehouse ancillary (gasoline, pharmacy, optical, food court, hearing aids and tire installation) and other businesses (e-commerce, business centers, travel and other)."},
{"link": "https://www.cnbc.com/quotes/DLTR", "name": "Dollar Tree Inc", "description": "Dollar Tree, Inc. is an operator of discount variety stores. Its business segments include Dollar Tree and Family Dollar. Dollar Tree segment is the operator of discount variety stores offering merchandise predominantly at the fixed price. Its stores are operating under the brand names Dollar Tree and Dollar Tree Canada. It operates 15 distribution centers in the United States and two in Canada. Dollar Tree stores consists of consumable merchandise, variety merchandise, and seasonal goods. Family Dollar segment operates general merchandise retail discount stores providing customers with a selection of merchandise in convenient neighborhood stores. Family Dollar segment consists of its store operations under the Family Dollar brand and 10 distribution centers. Family Dollar stores consists of consumable merchandise, home products, apparel and accessories merchandise, and seasonal and electronics merchandise. It also owns trademarks, including Family Dollar and Family Dollar Stores."},
{"link": "https://www.cnbc.com/quotes/KLAC", "name": "KLA Corp", "description": "KLA Corporation is a supplier of process control and yield management solutions and services for the semiconductor and related electronics industries. The Company offers a portfolio of inspection and metrology products, and related services, software and other offerings, supports research and development (R&D) and manufacturing of integrated circuits (ICs), wafers and reticles. Its segments include Semiconductor Process Control, Specialty Semiconductor Process and PCB, Display and Component Inspection. Semiconductor Process Control segment provides comprehensive portfolio of inspection, metrology and software products, and related services, helping IC, wafer, reticle/mask and chemical/materials manufacturers achieve target yields throughout the entire fabrication process, from R&D to final volume production. The Specialty Semiconductor Process segment develops and sells advanced vacuum deposition and etch process tools, which are used by a range of specialty semiconductor customers."},
{"link": "https://www.cnbc.com/quotes/CTSH", "name": "Cognizant Technology Solutions Corp", "description": "Cognizant Technology Solutions Corporation is a professional services company. The Company operates through four segments: Financial Services (FS), Health Sciences (HS), Products and Resources (P&R), and Communications, Media and Technology (CMT). The FS segment includes banking, capital markets, payments and insurance companies. The HS segment consists of healthcare providers and payers, as well as life sciences companies, including pharmaceutical, biotech and medical device companies. The P&R segment includes manufacturers, automakers, retailers and travel and hospitality companies, as well as companies providing logistics, energy, and utility services. The CMT segment includes global communications, media and entertainment, education, information services and technology companies. Its services include digital services and solutions, consulting, application development, systems integration, quality engineering and assurance, application maintenance, infrastructure and security."},
{"link": "https://www.cnbc.com/quotes/REGN", "name": "Regeneron Pharmaceuticals Inc", "description": "Regeneron Pharmaceuticals, Inc. is an integrated biotechnology company that discovers, invents, develops, manufactures, and commercializes medicines for serious diseases. The Company's commercialized medicines and product candidates in development are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, pain, hematologic conditions, infectious diseases and rare diseases. It helps in accelerating and improving the traditional drug development process through its VelociSuite technologies, such as VelocImmune, which uses genetically humanized mice to produce optimized fully human antibodies and bispecific antibodies, and through research initiatives, such as Regeneron Genetics Center. It operates gene therapy programs targeting different forms of congenital, monogenic hearing loss. Its advanced clinical-stage candidate is DB-OTO, which is an investigational cell-selective, adeno-associated virus (AAV) gene therapy."},
{"link": "https://www.cnbc.com/quotes/GOOG", "name": "Alphabet Class C", "description": "Alphabet Inc. is a holding company. The Company's segments include Google Services, Google Cloud, and Other Bets. The Google Services segment includes products and services such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube. The Google Cloud segment includes infrastructure and platform services, collaboration tools, and other services for enterprise customers. The Other Bets segment includes earlier stage technologies that are further afield from its core Google business, and it includes the sale of health technology and Internet services. Its Google Cloud provides enterprise-ready cloud services, including Google Cloud Platform and Google Workspace. Google Cloud Platform provides technology in cybersecurity; data, analytics, artificial intelligence (AI), machine learning and infrastructure. The Company's Google Workspace's secure communication and collaboration tools, which include apps, such as Gmail, Docs, Drive, Calendar, Meet, and others."},
{"link": "https://www.cnbc.com/quotes/AMD", "name": "Advanced Micro Devices Inc", "description": "Advanced Micro Devices, Inc. is a global semiconductor company. The Company operates through four segments: Data Center, Client, Gaming, and Embedded. The Data Center segment includes server central processing units (CPUs) and graphics processing units (GPUs), data processing units (DPUs), field programmable gate arrays (FPGAs) and adaptive system-on-a-chip (SoC) products for data centers. The Client segment includes CPUs, accelerated processing units (APUs) that integrate microprocessors and GPUs (APUs), and chipsets for desktop and notebook personal computers. The Gaming segment includes discrete GPUs, semi-custom SoC products and development services. The Embedded segment, which primarily includes embedded CPUs and GPUs, FPGAs, and adaptive SoC products. The Company’s CPUs for desktop platforms include the AMD Ryzen and AMD Athlon series processors. Its mobile APUs include AMD Ryzen and AMD Athlon mobile processors for the commercial and consumer markets."},
{"link": "https://www.cnbc.com/quotes/PEP", "name": "PepsiCo Inc.", "description": "PepsiCo, Inc. is a beverage and convenient food company. The Company's segments include Frito-Lay North America, which includes its food businesses in the United States and Canada; Quaker Foods North America, which includes its food businesses, such as cereal, rice, pasta and other branded food, in the United States and Canada; PepsiCo Beverages North America, which includes its beverage businesses in the United States and Canada; Latin America, which includes its beverage and convenient food businesses in Latin America; Europe, which includes its beverage and convenient food businesses in Europe; Africa, Middle East and South Asia (AMESA), which includes all of its beverage and convenient food businesses in Africa, the Middle East and South Asia; and Asia Pacific, Australia and New Zealand and China Region (APAC), which includes all of its beverage and convenient food businesses in Asia Pacific, Australia and New Zealand, and China region. Its brands include Lays, Doritos and Cheetos."},
{"link": "https://www.cnbc.com/quotes/CRWD", "name": "CrowdStrike Holdings Inc", "description": "CrowdStrike Holdings, Inc. is a cybersecurity company that provides cloud-delivered protection of endpoints, cloud workloads, identity and data via a software-as-a-service (SaaS) subscription-based model. The Company offers Falcon platform in a SaaS subscription-based model, which delivers integrated, technologies that deliver protection and performance, while reducing customer complexity. The Company's Falcon platform leverages a single lightweight-agent architecture with integrated cloud modules spanning multiple security markets, including corporate workload security, managed security services, security and vulnerability management, information technology (IT) operations management, threat intelligence services, identity protection and log management. The Company offers approximately 23 cloud modules on its Falcon platform, which include Falcon Prevent, Falcon Insight, Falcon Device Control, Falcon Firewall Management, Falcon XDR, Falcon Discover, Falcon Spotlight and others."},
{"link": "https://www.cnbc.com/quotes/EBAY", "name": "eBay Inc", "description": "eBay Inc. is a global commerce company, through its Marketplace platforms, which connects buyer and seller in more than 190 markets around the world. The Company's products include Promoted Listings Standard, Promoted Listings Express, Promoted Listings Advanced and External Promoted Listings. It has developed user interfaces, buyer, seller and developer tools and transaction processing, database and network applications that help enable its users to reliably and securely complete transactions on its sites. Its platforms include online marketplace located at www.ebay.com and its localized counterparts, including an off-platform business in Japan, as well as eBay’s suite of mobile apps. The platforms are accessible through an online experience (desktop and laptop computers), iOS and Android mobile devices and its application programming interfaces (APIs platform access for third party software developers). It offers TCGplayer a technology platform specializing in trading card games."},
{"link": "https://www.cnbc.com/quotes/CSGP", "name": "CoStar Group Inc", "description": "CoStar Group, Inc. is a provider of online real estate marketplaces, information and analytics in the United States (U.S.) and United Kingdom (U.K.). The Company provides online marketplaces for commercial real estate, apartment rentals, residential real estate, land for sale and businesses for sale. The Company manages its business geographically in two segments: North America, which includes the United States and Canada, and International, which primarily includes Europe, Asia-Pacific and Latin America. It also offers online platforms that manage workflow and marketing for residential real estate agents and brokers and provides a portal for homebuyers to view residential property listings. Its services are primarily derived from a database of building-specific information and offer customers specialized tools for accessing, analyzing and using its information. The Company's brands include CoStar, STR, Apartments.com, LoopNet, Homes.com, Homesnap, Ten-X, BizBuySell and Land.com."},
{"link": "https://www.cnbc.com/quotes/ZM", "name": "Zoom Video Communications Inc", "description": "Zoom Video Communications, Inc. is a provider of video communication platforms. The Company provides a unified communications and collaboration platform that delivers fundamental changes how people interact, connecting them through frictionless and secure meetings, phone, chat, content sharing and more. The Company’s core products are grouped under various categories: Zoom One, including Zoom Meetings, Zoom Phone, Zoom Team Chat, Zoom Mail and Calendar and Zoom Whiteboard, and Zoom Spaces, including Zoom Rooms and Workspace Reservation. The Company’s core products categories also include Zoom Events, including Zoom Sessions and Zoom Webinars; Zoom Contact Center, including Zoom Virtual Agent; Zoom AI, including Zoom IQ for Sales, and Zoom Developers, including Zoom Developer Platform, Zoom App Marketplace and Zoom Apps. It serves various industries, including education, entertainment/media, enterprise infrastructure, finance, government, healthcare, manufacturing, and others."},
{"link": "https://www.cnbc.com/quotes/IDXX", "name": "IDEXX Laboratories Inc", "description": "IDEXX Laboratories, Inc. develops, manufactures and distributes products and provides services for the companion animal veterinary, livestock and poultry, dairy and water testing markets. It also offers human medical point-of-care and laboratory diagnostics. Its segments include Companion Animal Group (CAG), Water quality products (Water), and Livestock, Poultry and Dairy (LPD). The CAG segment provides products and services for veterinarians and the biomedical research community, primarily related to diagnostics and information management. The Water segment provides testing solutions for the detection and quantification of various microbiological parameters in water. The LPD segment provides diagnostic tests, services, and related instrumentation that are used to manage the health status of livestock and poultry. The Company has sales offices outside the United States in all regions, including Africa, Asia Pacific, Canada, Europe, the Middle East, and Latin America."},
{"link": "https://www.cnbc.com/quotes/WBD", "name": "Warner Bros Discovery Inc", "description": "Warner Bros. Discovery, Inc. is a global media and entertainment company. The Company operates through three segments: Studios, Networks, and DTC. The Studios segment consists of the production and release of feature films for initial exhibition in theaters, production, and initial licensing of television programs to third parties. It also includes networks/DTC services, distribution of its films and television programs to various third party and internal television and streaming services, distribution through the home entertainment market (physical and digital), related consumer products and themed experience licensing, and interactive gaming. The Networks segment primarily consists of its domestic and international television networks. The DTC segment primarily consists of its premium pay-TV and streaming services. The Company's brands and franchises include Warner Bros. Pictures Group, Warner Bros. Television Group, DC, HBO, HBO Max, Discovery Channel, discovery+, and CNN."},
{"link": "https://www.cnbc.com/quotes/DXCM", "name": "Dexcom Inc", "description": "DexCom, Inc. is a medical device company. The Company is primarily focused on the design, development, and commercialization of continuous glucose monitoring (CGM), systems for use by people with diabetes and by healthcare providers. Its Dexcom G6 is a CGM system that can be used as part of an integrated system with other compatible medical devices and electronic interfaces, which may include automated insulin dosing systems, insulin pumps, blood glucose meters or other electronic devices used for diabetes management. Its Dexcom Share remote monitoring system, offered for use with its Dexcom system, uses an application on the patient's mobile device to wirelessly transmit glucose information to the cloud and then to applications on the mobile devices of up to five designated recipients. Its Dexcom Real-Time API enables invited third-party developers to integrate real-time CGM data into their digital health applications and devices. Its other products include Dexcom ONE and Dexcom G7."},
{"link": "https://www.cnbc.com/quotes/PYPL", "name": "PayPal Holdings Inc", "description": "PayPal Holdings, Inc. is a technology platform that enables digital payments and simplifies commerce experiences on behalf of merchants and consumers worldwide. The Company's payment solutions enable its customers to connect, transact, and send and receive payments, whether they are online or in person. It operates a global, two-sided network at scale that connects merchants and consumers with 435 million active accounts across more than 200 markets. Its brands include PayPal, Braintree, Venmo, Xoom, Hyperwallet, PayPal Zettle, PayPal Honey, and Paidy. It enables consumers to exchange funds with merchants using a variety of funding sources, which include a bank account, a PayPal or Venmo account balance, PayPal and Venmo branded credit products, including its installment products, a credit card, a debit card, certain cryptocurrencies, or other stored value products such as gift cards, and eligible rewards. It also offers consumers person-to-person (P2P) payment solutions."},
{"link": "https://www.cnbc.com/quotes/SNPS", "name": "Synopsys Inc", "description": "Synopsys, Inc. offers electronic design automation (EDA) software that it uses to design and test integrated circuits (ICs). The Company provides software and hardware used to validate the electronic systems that incorporate chips and the software that runs on them. It provides technical services and support to help its customers develop advanced chips and electronic systems. These products and services are part of its Design Automation segment. It offers semiconductor intellectual property (IP) products, which are pre-designed circuits that engineers use as components of larger chip designs rather than designing those circuits themselves. These products and services are part of its Design IP segment. It is a provider of software tools and services that improve the security, quality and compliance of software in various industries, such as electronics, financial services, automotive, medicine, energy and industrials. These tools and services are part of its Software Integrity segment."},
{"link": "https://www.cnbc.com/quotes/ISRG", "name": "Intuitive Surgical Inc", "description": "Intuitive Surgical, Inc. develops, manufactures, and markets the da Vinci surgical system and the Ion endoluminal system. The Company's products and related services enable physicians and healthcare providers to access minimally invasive care. The systems consist of a surgeon console or consoles, a patient-side cart, a vision system, and instruments and accessories. Its da Vinci products consist of five categories, such as da Vinci surgical systems, da Vinci instruments and accessories, da Vinci Stapling, da Vinci Energy, and da Vinci Vision, including Firefly Fluorescence imaging systems and da Vinci Endoscopes. It also provides a suite of systems, learning, and services offerings. Its Ion endoluminal system extends its commercial offerings beyond surgery into diagnostic procedures, enabling minimally invasive biopsies in the lung. Its services include readiness support, maintenance support, perioperative consulting, customer hospital analytics, and market consulting optimization."},
{"link": "https://www.cnbc.com/quotes/BKNG", "name": "Booking Holdings Inc", "description": "Booking Holdings Inc. is a provider of travel and restaurant online reservation and related services. The Company offers its services through six consumer-facing brands: Booking.com, Priceline.com, agoda.com, Rentalcars.com, KAYAK and OpenTable, Inc. (OpenTable). Through the Company's brands, consumers can: book a range of accommodations, including hotels, motels, resorts, homes, apartments, bed and breakfasts, hostels and other properties; make a car rental reservation or arrange for an airport taxi; make a dinner reservation; book a flight, cruise, vacation package, tour or activity. Consumers can also use its meta-search services to easily compare travel reservation information, such as airline ticket, hotel reservation and rental car reservation information, from various online travel platforms at once. Booking.com offers accommodation reservation services for approximately 400,000 properties in over 220 countries and territories, and in over 40 languages."},
{"link": "https://www.cnbc.com/quotes/META", "name": "Meta Platforms Inc", "description": "Meta Platforms, Inc. builds technologies that help people connect, find communities, and grow businesses. The Company's products enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality (VR) headsets, and wearables. The Company operates through two segments: Family of Apps (FoA) and Reality Labs (RL). FoA segment includes Facebook, Instagram, Messenger, WhatsApp, and other services. RL segment includes augmented and VR-related consumer hardware, software, and content. Facebook enables people to connect, share, discover and communicate with each other on mobile devices and personal computers. Instagram is a place where people can express themselves through photos, videos, and private messaging, and connect with and shop from their favorite businesses. Its RL products include Meta Quest virtual reality devices, as well as software and content available through the Meta Quest Store, which enable a range of social experiences."},
{"link": "https://www.cnbc.com/quotes/INTU", "name": "Intuit Inc", "description": "Intuit Inc. is a global financial technology platform that helps consumers and small businesses prosper by delivering financial management, compliance, and marketing products and services. The Company operates through four segments: Small Business & Self-Employed, Consumer, Credit Karma and ProTax. The Small Business & Self-Employed segment serves small businesses and the self-employed around the world, and the accounting professionals who assist and advise them. Its offerings include QuickBooks financial and business management online services and desktop software, payroll solutions, time tracking, merchant payment processing solutions, and financing for small businesses. The Consumer segment serves consumers and includes do-it-yourself and assisted TurboTax income tax preparation products and services. Credit Karma segment serves consumers with a personal finance platform that provides personalized recommendations of credit card, home, auto and personal loans, and insurance products."},
{"link": "https://www.cnbc.com/quotes/GOOGL", "name": "Alphabet Class A", "description": "Alphabet Inc. is a holding company. The Company's segments include Google Services, Google Cloud, and Other Bets. The Google Services segment includes products and services such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube. The Google Cloud segment includes infrastructure and platform services, collaboration tools, and other services for enterprise customers. The Other Bets segment includes earlier stage technologies that are further afield from its core Google business, and it includes the sale of health technology and Internet services. Its Google Cloud provides enterprise-ready cloud services, including Google Cloud Platform and Google Workspace. Google Cloud Platform provides technology in cybersecurity; data, analytics, artificial intelligence (AI), machine learning and infrastructure. The Company's Google Workspace's secure communication and collaboration tools, which include apps, such as Gmail, Docs, Drive, Calendar, Meet, and others."},
{"link": "https://www.cnbc.com/quotes/CPRT", "name": "Copart Inc", "description": "Copart, Inc. is a provider of online auctions and vehicle remarketing services. The Company offers services to process and sell vehicles to dealers, dismantlers, rebuilders, exporters and to the general public. It sells vehicles on behalf of insurance companies, banks, finance companies, charities, fleet operators, dealers, vehicle rental companies, and individuals. It has approximately 250,000 vehicles available online every day with operations at over 200 locations in 11 countries, including the United States, Canada, the United Kingdom, Brazil, the Republic of Ireland, Germany, Finland, the United Arab Emirates, Oman, Bahrain and Spain. It provides vehicle sellers with a full range of services to process and sell vehicles primarily over the internet through its Virtual Bidding Third Generation internet auction-style sales technology, VB3. Vehicle sellers consist primarily of insurance companies, but also include banks, finance companies, charities, fleet operators and others."},
{"link": "https://www.cnbc.com/quotes/CSX", "name": "CSX Corp", "description": "CSX Corporation is a transportation company. The Company provides rail-based freight transportation services, including traditional rail service and transport of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It categorizes its products into primary lines of business such as merchandise, intermodal, coal and trucking. Its intermodal business links customers to railroads through trucks and terminals. Its merchandise business consists of shipments in markets, such as agricultural and food products, automotive, forest products, metals and equipment, and fertilizers. It transports domestic coal, coke and iron ore to electricity-generating power plants, steel manufacturers and industrial plants, as well as export coal to deep-water port facilities. Its principal operating subsidiary, CSX Transportation, Inc., provides an important link to the transportation supply chain through its route-mile rail."},
{"link": "https://www.cnbc.com/quotes/AMZN", "name": "Amazon.com Inc", "description": "Amazon.com, Inc. provides a range of products and services to customers. The products offered through its stores include merchandise and content that it purchased for resale and products offered by third-party sellers. It manufactures and sells electronic devices, including Kindle, Fire tablet, Fire TV, Echo, and Ring, and it develops and produces media content. It also offers subscription services such as Amazon Prime, a membership program. Its segments include North America, International and Amazon Web Services (AWS). The AWS segment consists of global sales of compute, storage, database, and other services for start-ups, enterprises, government agencies, and academic institutions. It provides advertising services to sellers, vendors, publishers, authors, and others, through programs, such as sponsored advertisements, display, and video advertising. Customers access its offerings through websites, mobile applications, Alexa, devices, streaming, and physically visiting its stores."},
{"link": "https://www.cnbc.com/quotes/MAR", "name": "Marriott International Inc", "description": "Marriott International, Inc. is an operator, franchisor and licensor of hotel, residential, timeshare, and other lodging properties under various brand names. The Company has two segments: U.S. & Canada and International. Its Classic Luxury hotel brands include JW Marriott, The Ritz-Carlton, and St. Regis. Its Distinctive Luxury hotel brands include W Hotels, The Luxury Collection, EDITION, and Bvlgari. Its Classic Premium hotel brands include Marriott Hotels, Sheraton, Delta Hotels by Marriott, Marriott Executive Apartments, and Marriott Vacation Club. Its Distinctive Premium hotel brands include Westin, Renaissance Hotels, Le Meridien, Autograph Collection Hotels, Gaylord Hotels, Tribute Portfolio, and Design Hotels. Its Classic Select hotel brands include Courtyard, Residence Inn, Fairfield, SpringHill Suites, Four Points, TownePlace Suites, and Protea Hotels. Its Distinctive Select hotel brands include Aloft Hotels, AC Hotels by Marriott, Element Hotels, and Moxy Hotels."},
{"link": "https://www.cnbc.com/quotes/ADSK", "name": "Autodesk Inc", "description": "Autodesk, Inc. is engaged in three-dimensional (3D) design, engineering and entertainment technology solutions, spanning architecture, engineering, construction, product design, manufacturing, media and entertainment. Its product offerings are focused on four primary product families: Architecture, Engineering and Construction, AutoCAD and AutoCAD LT, Manufacturing, and Media and Entertainment. Its products include AutoCAD Civil 3D; Building Connected; Architecture, Engineering and Construction Collection; Autodesk Build; Revit; AutoCAD; AutoCAD LT; Computer-Aided Manufacturing (CAM) Solutions; Fusion 360; Product Design and Manufacturing Collection; Inventor; Vault; Media and Entertainment Collection; Maya; ShotGrid, and 3ds Max. Its product development and manufacturing software provides manufacturers in automotive, transportation, industrial machinery, consumer products, and building product industries with digital design, engineering, manufacturing, and production solutions."},
{"link": "https://www.cnbc.com/quotes/GFS", "name": "Globalfoundries Inc", "description": "GlobalFoundries Inc. is a semiconductor manufacturer. The Company offers a range of mainstream wafer fabrication services and technologies. The Company manufactures a range of semiconductor devices, including microprocessors, mobile application processors, baseband processors, network processors, radio frequency modems, microcontrollers, and power management units. The Company's specialized foundry manufacturing processes include a library consisting of qualified circuit-building block designs (known as IP titles or IP blocks), and differentiated transistor and device technology. The Company's differentiated technology platforms include radio frequency (RF) silicon-on-insulator (SOI), Fin Field-Effect Transistor (FinFET), FDX fully depleted (FD) silicon-on-insulator (SOI), Complementary Metal-Oxide Semiconductor (CMOS), Silicon Germanium (SiGe) and Gallium Nitride (GaN) and Silicon Photonics (SiPh)."},
{"link": "https://www.cnbc.com/quotes/SBUX", "name": "Starbucks Corp", "description": "Starbucks Corp is a roaster, marketer, and retailer of specialty coffee with operations in approximately 83 markets. It has over 35,000 Company-operated and licensed stores. It operates through three segments: North America, which includes the United States and Canada; International, which includes China, Japan, Asia Pacific, Europe, Middle East, Africa, Latin America and the Caribbean; and Channel Development. Its North America and International segments include both Company-operated and licensed stores. Channel Development segment includes roasted whole bean and ground coffees, Seattle's Best Coffee, Starbucks and Teavana-branded single-serve products, a variety of ready-to-drink beverages, such as Frappuccino and Starbucks Doubleshot, foodservice products and other branded products sold worldwide outside of its Company-operated and licensed stores. It also sells goods and services under various brands, including Teavana, Seattle's Best Coffee, Ethos, Starbucks Reserve and Princi."},
{"link": "https://www.cnbc.com/quotes/PAYX", "name": "Paychex Inc", "description": "Paychex, Inc. is a provider of human capital management solutions for human resources (HR), payroll, benefits and insurance services for small-to-medium-sized businesses and their employees across the United States and parts of Europe. The Company offers a portfolio of HCM technology and HR advisory solutions that help its clients navigate the challenges of HR. Its clients have the option of doing payroll online using its software as a service (SaaS) technology, outsourcing to its payroll specialists, or using a combination of those solutions. Payroll is integrated with HCM software modules for clients who have more complex HR needs. It also provides comprehensive HR outsourcing through its administrative services organization and PEO solutions. The Company's HCM SaaS platform is Paychex Flex, which provides workforce management throughout the employee life cycle from recruiting and hiring to retirement, including recruiting, onboarding, HR, time and attendance and employee benefits."},
{"link": "https://www.cnbc.com/quotes/MSFT", "name": "Microsoft Corp", "description": "Microsoft Corporation is a technology company. The Company develops and supports software, services, devices, and solutions. The Company’s segments include Productivity and Business Processes, Intelligent Cloud, and More Personal Computing. The Productivity and Business Processes segment consists of products and services in its portfolio of productivity, communication, and information services. This segment primarily comprises: Office Commercial, Office Consumer, LinkedIn, and Dynamics business solutions. The Intelligent Cloud segment consists of server products and cloud services, including Azure and other cloud services, SQL Server, Windows Server, Visual Studio, System Center, and related Client Access Licenses (CALs), and Nuance and GitHub; and Enterprise Services, including enterprise support services, industry solutions and Nuance professional services. The More Personal Computing segment primarily comprises Windows, devices, gaming, and search and news advertising."},
{"link": "https://www.cnbc.com/quotes/CEG", "name": "Constellation Energy Corp", "description": "Constellation Energy Corporation is a producer of clean energy and a supplier of energy products and services. The Company operates through five segments: Mid-Atlantic, Midwest, New York, ERCOT, and Other Power Regions, including New England, South, West and Canada. The Company’s generating capacity includes primarily nuclear, wind, solar, natural gas and hydroelectric assets. Through its integrated business operations, the Company sells electricity, natural gas, and other energy-related products and sustainable solutions to various types of customers. The Company serves industries, including distribution utilities, municipalities, cooperatives, and commercial, industrial, governmental, and residential customers in markets across multiple geographic regions. Its fleet is enabling the acceleration of the nation’s transition to a carbon-free future with more than 32,355 megawatts of capacity. The Company serves over 48 states, the District of Columbia, Canada, and the United Kingdom."},
{"link": "https://www.cnbc.com/quotes/TXN", "name": "Texas Instruments Inc", "description": "Texas Instruments Incorporated designs, makes and sells semiconductors to electronics designers and manufacturers across the world. The Company operates through two segments: Analog and Embedded Processing. The Company's Analog segment product lines include Power and Signal Chain. Power includes products that help customers manage power in electronic systems. Its broad portfolio is designed to manage power requirements across different voltage levels, including battery-management solutions, direct current (DC)/DC switching regulators, alternating current (AC)/DC and isolated controllers and converters, power switches, linear regulators, voltage references and lighting products. Signal Chain includes products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control. The Embedded Processing segment includes microcontrollers, digital signal processors (DSPs), and applications processors."},
{"link": "https://www.cnbc.com/quotes/ILMN", "name": "Illumina Inc", "description": "Illumina, Inc. is a provider of sequencing- and array-based solutions for genetic and genomic analysis. The Company operates through two segments: Core Illumina and GRAIL. Its Core Illumina segment offers products and services that serve customers in the research, clinical and applied markets, and enable the adoption of a variety of genomic solutions. Its GRAIL segment is a healthcare company focused on early detection of multiple cancers. Its portfolio of integrated sequencing and microarray systems, consumables, and analysis tools is designed to accelerate and simplify genetic analysis. Its BaseSpace Informatics Suite integrates directly with its sequencing instruments, allowing customers to manage their biological sample and sequencing runs, process and analyze the raw genomic data, and derive results. Its BeadArray technology combines microscopic beads and a substrate in a proprietary manufacturing process to produce arrays that can perform various assays simultaneously."},
{"link": "https://www.cnbc.com/quotes/SGEN", "name": "Seagen Inc", "description": "Seagen Inc. is a biotechnology company that develops and commercializes targeted therapies to treat cancer. The Company is engaged in commercializing ADCETRIS, or brentuximab vedotin, for the treatment of certain CD30-expressing lymphomas; PADCEV, or enfortumab vedotin-ejfv, for the treatment of certain metastatic urothelial cancers; TUKYSA, or tucatinib, for the treatment of certain metastatic human epidermal growth factor receptor 2 (HER2) -positive breast and colorectal cancers, and TIVDAK, or tisotumab vedotin-tftv, for the treatment of certain metastatic cervical cancers. It is also advancing a pipeline of novel therapies for solid tumors and blood-related cancers designed to address unmet medical needs and improve treatment outcomes for patients. Its programs including ADCETRIS, PADCEV and TIVDAK, are based on the Company’s antibody-drug conjugate (ADC) technology that utilizes the targeting ability of monoclonal antibodies to deliver cell-killing agents directly to cancer cells."},
{"link": "https://www.cnbc.com/quotes/EA", "name": "Electronic Arts", "description": "Electronic Arts Inc. is a digital interactive entertainment company. The Company develops, markets, publishes, and delivers games, content and services that can be played by consumers on a range of platforms, which include game consoles, personal computers (PCs), mobile phones and tablets. Its portfolio includes brands that it either wholly owns, such as Apex Legends, Battlefield, and The Sims or licenses from others, such as Madden NFL, Star Wars, and the 300 plus licenses within its global football ecosystem. The Company develops and publishes games and services across diverse genres, such as sports, racing, first-person shooter, action, role-playing and simulation. The Company markets and sells its games and services through retail channels and through digital distribution channels. The Company also offers live services, including content, subscription offerings and sale of its base games and free-to-play games."},
{"link": "https://www.cnbc.com/quotes/PDD", "name": "PDD Holdings Inc", "description": "PDD Holdings Inc. is a multinational commerce company that owns and operates a portfolio of businesses. The Company is focused on bringing businesses and people into the digital economy, which benefits local communities and small businesses from improved productivity and new opportunities. The Company has built a network of sourcing, logistics, and fulfillment capabilities that support its underlying businesses."},
{"link": "https://www.cnbc.com/quotes/WBA", "name": "Walgreens Boots Alliance Inc", "description": "Walgreens Boots Alliance, Inc. is an integrated healthcare, pharmacy and retailing company. The Company operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The Company's U.S. Retail Pharmacy segment includes the Walgreens business, which includes the operations of retail drug stores, health and wellness services, and specialty and home delivery pharmacy services, and its equity method investment in AmerisourceBergen. Its International segment consists of pharmacy-led health and beauty retail businesses outside the United States and a pharmaceutical wholesaling and distribution business in Germany. Its portfolio of consumer brands include Walgreens, Boots, Duane Reade, the No7 Beauty Company, Benavides in Mexico and Ahumada in Chile. Its U.S. Healthcare segment is a consumer-centric, technology-enabled healthcare business that engages consumers through a personalized, omni-channel experience across the care journey."},
{"link": "https://www.cnbc.com/quotes/CTAS", "name": "Cintas Corp", "description": "Cintas Corporation develops uniform programs using fabric. The Company helps businesses of all types and sizes, primarily in the United States, as well as Canada and Latin America. The Company operates through two segments: Uniform Rental and Facility Services segment and the First Aid and Safety Services segment. The Uniform Rental and Facility Services segment consists of the rental and servicing of uniforms and other garments, including flame resistant clothing, mats, mops and shop towels and other ancillary items. This segment also includes restroom cleaning services and supplies and the sale of items from its catalogs to its customers. The First Aid and Safety Services segment consists of first aid and safety products and services. The remainder of its segments, which consists of the Fire Protection Services segment and the Uniform Direct Sale segment, is included in All Other. It provides its products and services to small service and manufacturing companies and to corporations."},
{"link": "https://www.cnbc.com/quotes/PCAR", "name": "Paccar Inc", "description": "PACCAR Inc (PACCAR) is a global technology company. The Company operates through three segments: Truck, Parts, and Financial Services. The Truck segment includes the design, manufacture, and distribution of light-, medium- and heavy-duty commercial trucks. PACCAR’s trucks are marketed under the Kenworth, Peterbilt, and DAF nameplates. The Company also designs and manufactures diesel engines, primarily for use in the Company’s trucks, at its facilities in Columbus, Mississippi; Eindhoven, the Netherlands; and Ponta Grossa, Brazil. The Parts segment includes the distribution of aftermarket parts for trucks and related commercial vehicles. The Financial Services segment includes finance and leasing products and services provided to customers and dealers. The Company operates in approximately 26 countries in North America, Europe, Australia, and South America. It also conducts full-service leasing operations in North America, Germany, and Australia under the PacLease trade name."},
{"link": "https://www.cnbc.com/quotes/MCHP", "name": "Microchip Technology Inc", "description": "Microchip Technology Inc is a provider of smart, connected, and secure embedded control solutions. It is engaged in selling its semiconductor products to distributors and non-distributor customers (direct customers). It operates through two segments: semiconductor products and technology licensing. The semiconductor products segment designs, develops, manufactures and markets mixed-signal microcontrollers, development tools and analog, interface, mixed-signal, timing, wired and wireless connectivity devices, and memory products. The technology licensing segment includes sales and licensing of the Company's intellectual property. It offers a range of general purpose mixed-signal microcontroller products. The Company’s analog product line consists of several families, including power management, linear, mixed-signal, high voltage, thermal management, discrete diodes and drivers, safety, security, timing, Universal Serial Bus (USB), ethernet, wireless and other interface products."},
{"link": "https://www.cnbc.com/quotes/AMAT", "name": "Applied Materials Inc", "description": "Applied Materials, Inc. provides manufacturing equipment, services and software to the semiconductor, display, and related industries. The Company operates through three segments: Semiconductor Systems, Applied Global Services, and Display and Adjacent Markets. Its Semiconductor Systems segment primarily consists of capital equipment used to fabricate semiconductor chips. Its Applied Global Services segment provides integrated solutions to optimize equipment and fab performance and productivity, including spares, upgrades, services, certain remanufactured old equipment and factory automation software for semiconductor, display and solar products. Its Display and Adjacent Markets segment includes products for manufacturing liquid crystal and organic light-emitting diode (OLED) displays, and other display technologies for televisions, monitors, laptops, personal computers, electronic tablets, smart phones, and other consumer-oriented devices and equipment upgrades."},
{"link": "https://www.cnbc.com/quotes/NFLX", "name": "Netflix Inc", "description": "Netflix, Inc. is an entertainment services company. The Company has paid memberships in over 190 countries with television (TV) series, films and games across a variety of genres and languages. Its members can play, pause and resume to watch, as much as they want, anytime, anywhere, and can change their plans at any time. It offers a variety of streaming membership plans, the price of which varies by country, and the features of the plan. The pricing of its plans ranges from United States dollar equivalent of approximately $1 to $26 per month. It offers members the ability to receive streaming content through a host of Internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. The Company has agreements with various cable, satellite and telecommunications operators to make its service available through the TV set-top boxes of these service providers. The Company acquires, licenses, and produces content, including original programming."},
{"link": "https://www.cnbc.com/quotes/NVDA", "name": "NVIDIA Corp", "description": "NVIDIA Corporation accelerates computing to help solve the computational problems. The Company has two segments. The Compute & Networking segment includes its data center accelerated computing platform; networking; automotive artificial intelligence (AI) cockpit, autonomous driving development agreements and autonomous vehicle solutions; electric vehicle computing platforms; Jetson for robotics and other embedded platforms; NVIDIA AI Enterprise and other software; and cryptocurrency mining processors (CMP). The Graphics segment includes GeForce GPUs for gaming and personal computers (PCs), the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU (vGPU), software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and omniverse enterprise software for building and operating metaverse and three-dimensional Internet applications."},
{"link": "https://www.cnbc.com/quotes/FTNT", "name": "Fortinet Inc", "description": "Fortinet, Inc. is engaged in offering cybersecurity and networking solutions. The Company provides cyber security solutions to a variety of organizations, including enterprises, communication service providers, security service providers, government organizations and small businesses. The Company’s product offerings consist of its core platform network security products and its enhanced platform technology products, which are offered in a range of forms spanning physical appliances, virtual appliances, software, and cloud-hosted services. Its Secure Networking solutions enable the convergence of networking and security across all edges to provide next generation firewall, software-defined wide area network (SD- WAN), and secure access service edge (SASE). Its Zero Trust Access solutions enable customers to know and control who and what is on their network. Its FortiGuard security services counter threats in real time with artificial intelligence-powered, coordinated protection."},
{"link": "https://www.cnbc.com/quotes/ENPH", "name": "Enphase Energy Inc", "description": "Enphase Energy, Inc. is a global energy technology company. The Company designs, develops, manufactures and sells home energy solutions that manage energy generation, energy storage and control and communications on one platform. Its Enphase Energy System brings a high technology, networked approach to solar generation plus energy storage, by leveraging its design for power electronics, semiconductors and cloud-based software technologies. Its integrated approach to energy solutions increases a home energy potential while, providing advanced monitoring and remote maintenance capabilities. The Enphase Energy System uses a single technology platform for seamless management of the whole solution, enables rapid commissioning with the Enphase Installer Application, consumption monitoring with Enphase IQ Gateway with IQ Combiner+, Enphase Application, a cloud-based energy management platform and its IQ Battery. Its commercial systems have been deployed in approximately 145 countries."},
{"link": "https://www.cnbc.com/quotes/INTC", "name": "Intel Corp", "description": "Intel Corporation is engaged in designing and manufacturing products and technologies. The Company's segments include Client Computing Group (CCG), Data Center and AI (DCAI), Network and Edge (NEX), Mobileye, Accelerated Computing Systems and Graphics (AXG), and Intel Foundry Services (IFS). The CCG segment is focused on long-term operating system, system architecture, hardware, and application integration that enable PC experiences. Its DCAI segment offers workload-optimized solutions to cloud service providers and enterprise customers, along with silicon devices for communications service providers. Its NEX segment helps networks and edge compute systems from inflexible fixed-function hardware to general-purpose compute, acceleration, and networking devices running cloud-native software on programmable hardware. The Mobileye segment provides driving assistance and self-driving solutions. AXG segment delivers products and technologies to its customers to solve computational problems."},
{"link": "https://www.cnbc.com/quotes/TEAM", "name": "Atlassian Corp", "description": "Atlassian Corporation is a global software company that designs, develops, licenses, and maintains software and provisions software hosting services. Its products include Jira Software, Jira Align, Jira Service Management, Confluence, Trello, Atlassian Access and Bitbucket. Jira Software and Jira Work Management provide a flexible workflow management system that helps plan, organize, track and manage work and projects. Confluence is a social and flexible content collaboration platform used to create, share, organize, and discuss projects. Trello is a collaboration and organization product. Jira Service Management is an intuitive and flexible service desk product for creating and managing services for information technology, legal, and human resources teams. Bitbucket is a code management and collaboration product for teams using distributed version control systems. It also offers additional products, including Atlassian cloud apps and Crowd."},
{"link": "https://www.cnbc.com/quotes/EXC", "name": "Exelon Corp", "description": "Exelon Corporation is an energy delivery company. The Company conducts substantially all of its business operations through its subsidiaries. It is engaged in the energy distribution and transmission businesses through Commonwealth Edison Company (ComEd), Commonwealth Edison Company (PECO), Baltimore Gas and Electric Company (BGE), Pepco Holdings LLC (PHI) Potomac Electric Power Company (Pepco), Delmarva Power & Light Company (DPL), and Atlantic City Electric Company (ACE). It operates six reportable segments, which include ComEd, PECO, BGE, and PHI’s three reportable segments consisting of Pepco, DPL, and ACE. ComEd, PECO, BGE, Pepco, DPL, and ACE each represent a single reportable segment. Through its business services subsidiary, Exelon Business Services Company, LLC (BSC), the Company provides its subsidiaries with a variety of support services at cost, including legal, human resources, financial, information technology, and supply management services."},
{"link": "https://www.cnbc.com/quotes/ALGN", "name": "Align Technology Inc", "description": "Align Technology, Inc. is a medical device company. The Company is primarily engaged in the design, manufacture and marketing of Invisalign clear aligners for the treatment of malocclusions, or the misalignment of teeth, by orthodontists and general dental practitioners (GPs), Vivera retainers for retention, iTero intraoral scanners and services for dentistry, and exocad computer-aided design and computer-aided manufacturing (CAD/CAM) software. It operates through two segments: Clear Aligner and Imaging Systems and CAD/CAM Services (Systems and Services). Its Clear Aligner segment consists of Comprehensive Products, which includes Invisalign Comprehensive and Invisalign First; Non-Comprehensive Products, which includes Invisalign Moderate, Lite and Express packages and Invisalign Go, and Non-Case products, which include retention products, Invisalign training, adjusting tools used by dental professionals. Its Systems and Services segment consists of iTero intraoral scanning systems."},
{"link": "https://www.cnbc.com/quotes/MRNA", "name": "Moderna Inc", "description": "Moderna, Inc. is a biotechnology company. The Company is focused on developing messenger ribonucleic acid (mRNA) therapeutics and vaccines. It is developing therapeutics and vaccines for infectious diseases, immuno-oncology, rare diseases, autoimmune and cardiovascular diseases, independently and with its strategic collaborators. mRNA medicines are designed to direct the body’s cells to produce intracellular, membrane, or secreted proteins that have a therapeutic or preventive benefit with the potential to address a range spectrum of diseases. The Company's products include Spikevax, the Moderna COVID-19 vaccine (mRNA-1273), a bivalent vaccine targeting the BA.1 Omicron variant, combined with Spikevax (mRNA-1273.214), and bivalent vaccine targeting the BA.4/BA.5 Omicron variants combined with Spikevax (mRNA-1273.222). It has a development pipeline of 45 development candidates across its 48 development programs, of which 38 are in clinical studies."},
{"link": "https://www.cnbc.com/quotes/ATVI", "name": "Activision Blizzard Inc", "description": "Activision Blizzard, Inc. is a developer and publisher of interactive entertainment content and services. It develops and distributes content and services on video game consoles, personal computers, and mobile devices. It operates e-sports leagues and offers digital advertising within some of its content. Its segments include Activision Publishing, Inc. (Activision), Blizzard Entertainment, Inc. (Blizzard), King Digital Entertainment (King), and Others. Activision segment delivers content through both premium and free-to-play offerings and also includes the activities of the Call of Duty League, a global professional e-sports league. Blizzard segment delivers content through both premium and free-to-play offerings and maintains an online gaming service, Blizzard Battle.net, which facilitates the digital distribution of Blizzard content and selected Activision content. King segment delivers content on the mobile platform. Kings’ product franchise is Candy Crush, a match-three franchise."},
{"link": "https://www.cnbc.com/quotes/AZN", "name": "AstraZeneca PLC", "description": "AstraZeneca PLC is a science-led biopharmaceutical company. The Company focuses on the discovery, development, and commercialization of prescription medicines in oncology, rare diseases, and biopharmaceuticals, including cardiovascular, renal & metabolism, and respiratory and immunology. Its pipeline forms a portfolio of investigational therapies in various stages of clinical development and includes the Alexion Rare Disease portfolio comprising approximately 178 projects. Its key marketed oncology products include Tagrisso, Imfinzi, Lynparza, Calquence, Enhertu, Orpathys, Zoladex, Faslodex and others. Its rare diseases products include Soliris, Ultomiris, Strensiq and Kanuma. Its BioPharmaceuticals products include Farxiga, Lokelma, Crestor, Breztri and others. Its geographical segments include United Kingdom, Rest of Europe, the Americas and Asia, Africa and Australasia. It is also focused on discovering, developing, and manufacturing of T-cell receptor therapies."},
{"link": "https://www.cnbc.com/quotes/MNST", "name": "Monster Beverage Corp", "description": "Monster Beverage 1990 Corporation is a holding company. Through its subsidiaries, it develops, markets, sells and distributes energy drink beverages and concentrates on energy drink beverages under various brand names. The Company’s segments include Monster Energy Drinks, which is comprised of its Monster Energy drinks, Reign Total Body Fuel high performance energy drinks, Monster Tour Water and True North Pure Energy Seltzers; Strategic Brands segment, which is comprised of the various energy drink brands; Alcohol Brands segment, which is comprised of the various craft beers and hard seltzers, as well as The Beast Unleashed FMBs, and Other segment, which is comprised of certain products sold by American Fruits and Flavors LLC, a wholly owned subsidiary of the Company, to independent third-party customers. Its brands include Monster Energy Ultra, Java Monster, Juice Monster, Monster Hydro Super Sport, Monster Dragon Tea, Reign Total Body Fuel, True North, Mother, and Predator."},
{"link": "https://www.cnbc.com/quotes/VRTX", "name": "Vertex Pharmaceuticals Inc", "description": "Vertex Pharmaceuticals Incorporated is a global biotechnology company. The Company is focused on developing medicines that treat the underlying cause of cystic fibrosis (CF). Its pipeline includes mid- and late-stage clinical programs in sickle cell disease, beta thalassemia, acute and neuropathic pain, APOL1-mediated kidney disease, type 1 diabetes, and alpha-1 antitrypsin deficiency, and earlier-stage programs in diseases such as muscular dystrophies. Its marketed medicines are TRIKAFTA/KAFTRIO (elexacaftor/tezacaftor/ivacaftor and ivacaftor), SYMDEKO/SYMKEVI (tezacaftor/ivacaftor and ivacaftor), ORKAMBI (lumacaftor/ivacaftor) and KALYDECO (ivacaftor). The Company has a pipeline of investigational small molecule, cell and genetic therapies in other serious diseases where it has deep insight into causal human biology, including sickle cell disease, beta thalassemia, APOL1-mediated kidney disease, pain, type 1 diabetes, alpha-1 antitrypsin deficiency and Duchenne muscular dystrophy."},
{"link": "https://www.cnbc.com/quotes/MRVL", "name": "Marvell Technology Inc", "description": "Marvell Technology, Inc., through its subsidiaries, is a supplier of data infrastructure semiconductor solutions. The Company is engaged in the design, development, and sale of integrated circuits. Its product solutions serve five end markets, such as data center, enterprise networking, carrier infrastructure, consumer, and automotive/industrial. The Company’s product offerings include custom application-specific integrated circuits (ASICs), electro-optics, Ethernet solutions, fiber channel adapters, processors, and storage controllers. It develops custom system-on-a-chip (SoC) solutions tailored to individual customer specifications. Its electro-optical products include pulse amplitude modulation (PAM) and coherent digital signal processors (DSPs), laser drivers, trans-impedance amplifiers (TIAs), silicon photonics and data center interconnect (DCI) solutions. It offers a portfolio of Ethernet solutions spanning controllers, network adapters, physical transceivers, and switches."}
]